export const faqContent: Record<string, BOTTViewButtons[]> = {
  '/': [
    { label: 'Как безопасно создать бота?', link: '' },
    { label: 'Как сделать рассылку в боте?', link: '' },
    { label: 'Как изменить ссылку на бота?', link: '' },
    { label: 'Как добавить аватарку боту?', link: '' },
    { label: 'Html - что это?', link: '' },
    {
      label: 'Как сделать текст жирным и подобное Как передать, продать бота?',
      link: '',
    },
    { label: 'Как перевыпустить токен от бота?', link: '' },
  ],
};
