export const patterns = [
  {
    label: 'Шаблон для проверки номера телефона',
    description: 'Формат ввода +79998887766',
    value: '/\\+\\d{11}/',
    id: 0,
  },
  {
    label: 'Шаблон для проверки почты',
    description: 'Формат ввода example.ex@mail.com',
    value:
      '/^(([^<>()\\[\\]\\\\.,;:\\s@"]+(\\.[^<>()\\[\\]\\\\.,;:\\s@"]+)*)|(".+"))@((\\[[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}\\.[0-9]{1,3}])|(([a-zA-Z\\-0-9]+\\.)+[a-zA-Z]{2,}))$/',
    id: 1,
  },
  {
    label: 'Шаблон для проверки ссылки',
    description: 'Формат ввода https://bot-t.com',
    value: '/^(https?:\\/\\/)?([\\w-]{1,32}\\.[\\w-]{1,32})[^\\s@]*$/',
    id: 2,
  },
  // {
  //   label: "Шаблон для проверки даты",
  //   description: "",
  //   value: "/^-?[\\d]+\\/[0-1]\\d\\/[0-3]\\d$/",
  //   id: 3,
  // },
  // {
  //   label: "Шаблон для времени",
  //   description: "",
  //   value: "/^([0-1]?\\d|2[0-3]):[0-5]\\d$/",
  //   id: 4,
  // },
];

export const extensions = [
  'txt',
  'doc',
  'docx',
  'pdf',
  'pptx',
  'xls',
  'xlsx',
  'jpg',
  'png',
  'tif',
  'gif',
  'zip',
  'mp3',
  'mp4',
  'avi',
  'html',
  'css',
  'js',
];
